In [1]:
from utils.schedule_utils import load_data_split,table_to_str,table_to_str_sql,find_intersection_and_add_row_id,Prepare_Data_for_Operator_Sequence,format_document,batch_rerank_scores,ROLLBACK,merge_clean_and_format_df_dict,retrieve_rows_by_subtables,process_error_analysis_list
import pickle
import numpy as np
import pandas as pd
import os
import json
from FlagEmbedding import FlagReranker
from tqdm import tqdm
from typing import Dict, Any
from utils.evaluator import Evaluator
from utils.prompt_generate import build_wikitq_prompt_from_df,evaluate_predictions,filter_dataframe_from_responses,fix_sql_query,match_subtables,retrieve_rows_by_subtables,build_tab_fact_prompt_from_df
from utils.async_llm import infer_prompts

/home/aizoo/miniconda3/envs/hstar/lib/python3.9/site-packages/torch/cuda/__init__.py:63: FutureWarning: The pynvml package is deprecated. Please install nvidia-ml-py instead. If you did not install pynvml directly, please report this to the maintainers of the package that installed pynvml for you.
  import pynvml  # type: ignore[import]

In [2]:
from vllm import LLM, SamplingParams
from transformers import AutoTokenizer
import pandas as pd
import numpy as np
from time import sleep
import argparse
from vllm.lora.request import LoRARequest
import json
from tqdm import tqdm
import os

INFO 10-22 00:27:04 [__init__.py:216] Automatically detected platform cuda.

In [33]:
## 参数记录 for tab_fact
N_PARALLEL = 32 ## only for convert_df_type_parallel.py of data preprocess，一次性离线的
embedding_base_model_path = '/data/workspace/yanmy/models/bge-m3'
# llm_path = '/data/workspace/yanmy/models/Qwen3-30B-A3B-Instruct-2507-FP8'
llm_path = '/data/workspace/yanmy/models/Qwen2.5-7B-Instruct'
# llm_path = '/data/workspace/yanmy/models/Qwen3-4B-Instruct-2507'
router_model_path = '/data/workspace/yanmy/HybridRAG/H-STAR/router/bge-m3-router-tab_fact-hn' ## fine-tuned router model path
check_moedl_path = '/data/workspace/yanmy/HybridRAG/H-STAR/check/output/bge-reranker-v2-m3-finetuned-tab_fact' ## check model path
tmp_save_path = 'datasets/schedule_test/tab_fact_api_30B' ## 临时存储路径
dataset_name = 'tab_fact'
split = 'test_small'
tau = 0.75
check_tau = 0.8
ALL_LABELS = [
    'Base', 'Select_Row', 'Select_Column', 'Execute_SQL', 'RAG_20_5', 
]

### Pipeline 的过程分为以下调度步骤
- 所有调度需要的文件均放在了 `schedule_test/datasets/wikitq`与`schedule_test/datasets/tab_fact`文件夹里面
1. （独立的）跑下面的指令：`python convert_df_type_parallel.py --dataset_name tab_fact --split test_small --output_path datasets/schedule_test/tab_fact/wikitq_df_processed.npy --num_workers 32`
2. (独立的)读取 `datasets/schedule_test/tab_fact/wikitq_df_processed.npy`,构造 inference_router 的文件，输出到`datasets/schedule_test/tab_fact/router_query.pkl`
3. (独立的)构造 DB
4. (GPU-21GB) inference router model，输出route result 到 `datasets/schedule_test/tab_fact/inference_result.pkl` 通过命令：`python inference_router.py --input_path datasets/schedule_test/tab_fact/router_query.pkl --model_path /data/workspace/yanmy/HybridRAG/H-STAR/router/bge-m3-router-tab_fact-hn --output_path datasets/schedule_test/tab_fact/inference_result.pkl`
5. (CPU) 解析 router 结果，生成初步的路径并开始任务调度(重排)
6. (GPU-1.8G) 根据 `datasets/schedule_test/tab_fact/RAG_index.npy`，执行 RAG 任务，根据下面的指令
7. (GPU-vLLM) LLM 根据初步路径，对`Select_Row`, `Select_Column`, `Execute_SQL`执行中间命令
8. (CPU) 根据中间结果，link db 做sql command parse，执行 sql,返回 subtable_list
9. (GPU-1.8G) 加载并运行 Check Model，跑 3 次（FORWARD 机制）
10. (GPU-vLLM) add execute SQL
11. (GPU-vLLM) generate qa command, inference vLLM, evaluate

In [ ]:
## step:1
f'python convert_df_type_parallel.py --dataset_name {dataset_name} --split {split} --output_path {tmp_save_path}/wikitq_df_processed.npy --num_workers {N_PARALLEL}'

In [4]:
### 读取必要文件（step 2）
dataset = load_data_split(dataset_name,split)
wikitq_df_processed = np.load(f'{tmp_save_path}/wikitq_df_processed.npy',allow_pickle=True).item()

In [10]:
## step 2: 构建semantic router的输入文件，并输出
semantic_router = {}
# semantic_router[
for index in range(len(dataset)):
    semantic_router[index] = {}
    semantic_router[index]['query'] = dataset[index]['question']
    semantic_router[index]['title'] = dataset[index]['table']['page_title']
    semantic_router[index]['table'] = wikitq_df_processed[index]
    label_list = []
    semantic_router[index]['label'] = label_list
with open(f'{tmp_save_path}/router_query.pkl','wb') as f:
    pickle.dump(semantic_router,f)

In [6]:
## step 3: Consturct DB
from utils.multi_db_v2 import NeuralDB, Executor
table_titles = [dataset[i]['table']['page_title'] for i in range(len(dataset))]
db = NeuralDB(tables=wikitq_df_processed, table_titles=table_titles)
executor = Executor()

Initializing NeuralDB...

Creating tables in DB:   0%|          | 0/2024 [00:00<?, ?it/s]

In [9]:
## step 4: inference router model
f'python inference_router.py --input_path {tmp_save_path}/router_query.pkl --model_path {router_model_path} --output_path {tmp_save_path}/inference_result.pkl'

'python inference_router.py --input_path datasets/schedule_test/tab_fact_api_30B/router_query.pkl --model_path /data/workspace/yanmy/HybridRAG/H-STAR/router/bge-m3-router-tab_fact-hn --output_path datasets/schedule_test/tab_fact_api_30B/inference_result.pkl'

In [11]:
## step 5
with open(f'{tmp_save_path}/inference_result.pkl', 'rb') as f:
    error_analysis_row = pickle.load(f)
ranked_result = process_error_analysis_list(error_analysis_row, truncate=True, tau=0.75)

In [34]:
## Organize LLM query list
LLM_query_list = {}
for method in ALL_LABELS:
    LLM_query_list[method] = {}
    LLM_query_list[method]['index'] = []
    LLM_query_list[method]['query'] = []
    LLM_query_list[method]['qa'] = []
for index in range(len(dataset)):
    for method in ALL_LABELS:
        if method in ranked_result[index]:
            # method_list = ranked_result[index][method]
            # method_list.append(index)
            LLM_query_list[method]['index'].extend([index])
            if method=='Select_Column':
                prompt = build_wikitq_prompt_from_df(dataset,wikitq_df_processed[index],index,template_path='../prompts/col_select_sql.txt',processed=True)
                LLM_query_list[method]['query'].extend([prompt])
            elif method=='Select_Row':
                prompt = build_wikitq_prompt_from_df(dataset,wikitq_df_processed[index],index,template_path='../prompts/row_select_sql.txt',processed=True)
                LLM_query_list[method]['query'].extend([prompt])
            elif method == 'Execute_SQL':
                prompt = build_wikitq_prompt_from_df(dataset,wikitq_df_processed[index],index,template_path='../prompts/sql_reason_tabfact.txt',processed=True)
                LLM_query_list[method]['query'].extend([prompt])
            # elif method == 'Base':
            #     prompt = build_wikitq_prompt_from_df(dataset,wikitq_df_processed[index],index,template_path='../prompts/text_reason_tabfact.txt',processed=True)
            #     LLM_query_list[method]['qa'].extend([prompt])

In [13]:
## 暂存 RAG 的 list，输出到路径
np.save(f'{tmp_save_path}/RAG_index.npy',LLM_query_list['RAG_20_5']['index'])

- 执行`Hybrid_Retrieve.py` 任务

In [14]:
## step 6: RAG
f"python Hybrid_Retrieve_Update_dict.py \
    --model_path {embedding_base_model_path} \
    --dataset_name {dataset_name} \
    --split {split} \
    --index_path {tmp_save_path}/RAG_index.npy \
    --output_path {tmp_save_path}/Hybrid_Retrieve_output.npy \
    --max_rows 50 \
    --max_cols 10 \
    --processed_df_path {tmp_save_path}/wikitq_df_processed.npy \
    --rewrite_query_path datasets/schedule_test/{dataset_name}/rewrite_query.npy"

'python Hybrid_Retrieve_Update_dict.py     --model_path /data/workspace/yanmy/models/bge-m3     --dataset_name tab_fact     --split test_small     --index_path datasets/schedule_test/tab_fact_api_30B/RAG_index.npy     --output_path datasets/schedule_test/tab_fact_api_30B/Hybrid_Retrieve_output.npy     --max_rows 50     --max_cols 10     --processed_df_path datasets/schedule_test/tab_fact_api_30B/wikitq_df_processed.npy     --rewrite_query_path datasets/schedule_test/tab_fact/rewrite_query.npy'

In [35]:
## load Hybrid_Retrieve 的结果
RAG_20_5 = np.load(f'{tmp_save_path}/Hybrid_Retrieve_output.npy',allow_pickle=True).item()

In [52]:
## step 7: api vLLM
### Query LLM with async engine，启动模型采用 sh llm_server.sh，这个是不是可以放在调度的第一个环节，不计入时间

metrics_rows = {}
summary = {}
for method in ['Select_Row','Select_Column']:
    prompt_list = LLM_query_list[method]['query']
    response_list,metrics_rows[method],summary[method] = infer_prompts(prompt_list, temperature=0.7, top_p=0.8, sample_num=2, llm_path = llm_path)
    LLM_query_list[method]['response'] = response_list
for method in ['Execute_SQL']:
    prompt_list = LLM_query_list[method]['query']
    response_list,metrics_rows[method],summary[method] = infer_prompts(prompt_list, temperature=0.7, top_p=0.8, sample_num=3, llm_path = llm_path)
    LLM_query_list[method]['response'] = response_list

Processed prompts:   0%|          | 0/18 [00:00<?, ?it/s]

Processed prompts: 100%|██████████| 18/18 [00:13<00:00,  1.36it/s, est. speed input=2469.45 toks/s, output=663.66 toks/s]
Processed prompts: 100%|██████████| 378/378 [00:36<00:00, 10.28it/s, est. speed input=23748.54 toks/s, output=2502.13 toks/s]
Processed prompts: 100%|██████████| 322/322 [00:58<00:00,  5.48it/s, est. speed input=11959.07 toks/s, output=2546.65 toks/s]

- row_sql

In [37]:
# row_sql = pd.read_csv(f'../datasets/pipeline/{dataset_name}_{split}_row_sql_output_4B.csv',index_col=0)
from tqdm.notebook import tqdm
sub_table_list_all = {}
filtered_tables_row = {}
row_sql_index_list = LLM_query_list['Select_Row']['index']
row_sql_response_list = LLM_query_list['Select_Row']['response']
for i in range(len(row_sql_index_list)):
    sample_num = [0,1]
    sub_table_list = []
    for sample_index in sample_num:
        ## 相对距离
        index = row_sql_index_list[i]
        #  = row_sql_response_list[i][sample_index]
        # relevant_index = row_sql_index_list.index(index)
        original_text = row_sql_response_list[i][sample_index]
        sql = fix_sql_query(response_text=original_text,table_df=wikitq_df_processed[index],table_title=table_titles[index])
        try:
            result_1 = executor.sql_exec(sql.replace('``','`').replace("COUNT(*)", "*"), db, table_id=index)
            sub_table_list.append(pd.DataFrame(result_1['rows'],columns=result_1['header']))
        except:
            continue
    print(dataset[index]['question'],dataset[index]['answer_text'])
    # match_subtables(large_table=wikitq_df_processed[index], sub_tables=[pd.DataFrame(result_1['rows'],columns=result_1['header'])])
    # pd.DataFrame(result_1['rows'],columns=result_1['header'])
    sub_table_list_all[index] = sub_table_list
    filtered_df = retrieve_rows_by_subtables(wikitq_df_processed[index],sub_table_list)
    if len(filtered_df) == 0:
        filtered_df = wikitq_df_processed[index]
    filtered_tables_row[index] = filtered_df

Executing on table_id 2 ('w2'): SELECT a FROM cgame c when cdate c when cjana a 3;
Executing on table_id 2 ('w2'):
the wildcats lost one game in september and two games in november 1
Executing on table_id 3 ('w3'):
Executing on table_id 3 ('w3'):
the wildcats played two games in september , four games in october , and four games in november 1
Executing on table_id 7 ('w7'):
Executing on table_id 7 ('w7'):
the wildcats loss one game in november and two games in september 0
Executing on table_id 8 ('w8'):
Executing on table_id 8 ('w8'):
the wildcats played four games in september , two games in october , and two games in november 0
Executing on table_id 491 ('w491'):
Executing on table_id 491 ('w491'): SELECT the SQL query to achieve this task:   CREATE TABLE IF NOT EXISTS players (  (  columns:  id INTEGER PRIMARY KEY,  AUTOINCREMENT,   name name full last 1 score VARCHAR   inassistant;
north avenue plain street market street has both 12.2 and 12.8 listed in the milepost column 1
Executing on table_id 497 ('w497'): typescript SELECT task FROM taskWHERE TASKTASKTASKTASKTASKTASKTASKTASKTASKTASKTASKTASKTASKTASKTASKTASKTASKTASKTASKTASKTASKTASKTASKTASKTASKTASKTASKTASKTASKTASKTASKTASKTASKTASKTASKTASKTASKTASKTASKTASK;
Executing on table_id 497 ('w497'):
milepost 12.8 is at weymouth 0
Executing on table_id 499 ('w499'):
Executing on table_id 499 ('w499'):
track 23 has a title : just a little bit 0
Executing on table_id 661 ('w661'):
Executing on table_id 661 ('w661'): SQL c SELECT * FROM cWHERE cnation == France(c: France c France  France a deep breath and start by step;
march is featured more often as a month in the date than any other month 1
Executing on table_id 921 ('w921'): SELECT *, 'date',, 'score',, 'loss',, 'attendance',, 'country' FROM yourTableName   WHERE 'blue_opponent' IS NOT NULL ORDER BY 'score' DESC;
Executing on table_id 921 ('w921'):
the blue jays scored twelve runs one time during the month 0
Executing on table_id 1066 ('w1066'): CREATE TABLE Games ( (  (  week column_names: ` (  date game week name week opponent VARCHAR(()  r date date result VARCHAR  c date date date_result VARCHAR \()    c date date date date date attendance VARCHAR \()  INSERT INTO Games (date, opponent,result,attendance) VALUES ('December 21 Miami Dolphins', ' " win 9 1 85  ` `'Miami Dolphins' `;
Executing on table_id 1066 ('w1066'):
there are two games that took place in the month of december 1
Executing on table_id 1071 ('w1071'):
Executing on table_id 1071 ('w1071'):
there are two games that took place in the month of november and december 0
Executing on table_id 1396 ('w1396'):
Executing on table_id 1396 ('w1396'): \b .;
only one game was played on november 27 1
Executing on table_id 1398 ('w1398'):
Executing on table_id 1398 ('w1398'): select schema schema schema schema schema schema schema schema schema schema schema schema schema schema c c c c c c c c c c c c c c c c c c c c c sql schema schema schema schema schema schema schema schema schema schema schema schema schema schema schema schema schema schema schema schema schema schema schema schema schema schema schema schema schema schema schema schema schema schema schema schema schema schema schema schema schema schema schema schema schema schema schema schema schema schema schema schema schema schema schema schema schema schema schema schema schema schema schema schema schema schema schema schema schema schema schema schema schema c c c c c c c c c c c c c c c c c c c c c sql schema schema schema schema schema schema schema schema schema schema schema schema schema schema schema schema schema schema schema schema schema schema schema schema schema schema schema schema schema schema schema schema schema schema schema schema schema schema schema schema schema schema schema schema schema schema schema schema schema schema schema schema schema schema schema schema schema schema schema schema schema schema;
only 2 games were played on november 27th 0
Executing on table_id 1427 ('w1427'): select query SQL statements could    c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c  c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c  c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c c                CREATE TABLE fighters_table (  (  columns [  fighter VARCHAR opponent varchar method  \  \n  \\\\  \\\\ \\ \SQLIDETABLE Create TABLE tournament\_ \\ \\ \\ \\\ \\ \SLIDEDELTATE  \ \ \ \ \  \\\ \columns tournament varchar( rank varchar [] \\\   \SLIDEDELTAable \ CREATE TABLE tournament\(tournament VARCHAR PRIMARY KEY\) \ \ \ \  \columns tournament varchar primary key \ \\\  \CREATE INDEX idx_op_byt \( ON tournament\(tournament)\ \wc  \\\  \CREATE VIEW championship\(ch tournament varchar PRIMARY KEY , \columns champ varchar \ \ /CREATE UNIQUE INDEX uni_champ ON championship\(chmp, tournament \ \cwc  \\\  wc \\\ wc \ wc \cwc \cwc \\\ wc \cwc \\\ wc \\\cwc \cwc \\\cwc \cwc \\\cwc \\\cwc \\\cwc \\\cwc \cwc \\\cwc \\\cwc \\\cwc \\\cwc \\\wc \\\cwc \\\cwc \\\cwc \\\wc \cwc \\\cwc \cwc \\\cwc \cwc \\\cwc \\\cwc \\\cwc \\\cwc \cwc \\\cwc \\\cwc \\\cwc \\\wc \cwc \\\cwc \\\cwc \cwc \\\cwc \\\cwc \\\cwc \cwc \\\cwc \\\cwc \\\cwc \\\wc \cwc \\\cwc \cwc \\\cwc \cwc \\\cwc \\\cwc \\\cwc \\\cwc \\\cwc \\\cwc \\\cwc \\\cwc \\\cwc \\n INSERT INTO championship(t \/( ' VALUES \wc \\\cwc \\\cwc \\\cwc \ INSERT INTO championship\(tournament,champ \aVALUES VALUESVALUESVALUESVALUESVALUESVALUESVALUESVALUESVALUESVALUESVALUESVALUESVALUESVALUESVALUESVALUESVALUESVALUESVALUESVALUESVALUESVALUESVALUESVALUESVALUESVALUESVALUESVALUESVALUESVALUESVALUESVALUESVALUESVALUESVALUESVALUESVALUESVALUESVALUESVALUESVALUESVALUESVALUESVALUESVALUESVALUESVALUESVALUESVALUESVALUESVALUESVALUESVALUESVALUESVALUESVALUESVALUESVALUESVALUESVALUESVALUESVALUESVALUESVALUESVALUESVALUESVALUESVALUESVALUESVALUESVALUESVALUESVALUESVALUESVALUESVALUESVALUESVALUESVALUESVALUESVALUESVALUESVALUESVALUESVALUESVALUESVALUESVALUESVALUESVALUESVALUESVALUESVALUESVALUESVALUESVALUESVALUESVALUESVALUESVALUESVALUESVALUESVALUESVALUESVALUESVALUESVALUESVALUESVALUESVALUESVALUESVALUESVALUESVALUES;
Executing on table_id 1427 ('w1427'):
only one match resulted in the result of a draw 1
Executing on table_id 1493 ('w1493'): c;
Executing on table_id 1493 ('w1493'):
only three of the projects have been completed so far 1
Executing on table_id 1495 ('w1495'):
Executing on table_id 1495 ('w1495'): NONE;
there were two projects in rankin county , sonford products and flowood site 1
Executing on table_id 1496 ('w1496'): c;
Executing on table_id 1496 ('w1496'): sql;
the first project proposed was potter co in copiah , but it has not yet been listed 1
Executing on table_id 1500 ('w1500'):
Executing on table_id 1500 ('w1500'): SELECT * FROM w WHERE_score = (SELECT MAX(`away_score`) FROM away) WHERE away_away IN (SELECT cFROM(SELECT ` FROM away GROUP CONCAT(a AS T ORDER BYc ASC LIMIT(c nation_origin_country IN ('France') GROUPBY away_c UNions;
rankin county was home to multiple projects that were proposed and listed 1

- col_sql

In [38]:
filtered_tables = {}
filtered_headers = {}
col_sql_index_list = LLM_query_list['Select_Column']['index']
col_sql_response_list = LLM_query_list['Select_Column']['response']
# for ind in tqdm(range(len(wikitq_df_processed))):
for i in range(len(col_sql_index_list)):
    ind = col_sql_index_list[i]
    
    input_df = wikitq_df_processed[ind]
    response_list = col_sql_response_list[i]
    assert isinstance(response_list,list)
    filtered_table, final_headers = filter_dataframe_from_responses(response_list, input_df, add_row_id=True)
    filtered_tables[ind] = filtered_table
    filtered_headers[ind] = final_headers

- SQL-exec

In [39]:
from tqdm.notebook import tqdm
sample_num = 3
sql_exec_df = {}
valid_parse = 0
warning_list = []
sql_executable_count = []
exec_sql_index_list = LLM_query_list['Execute_SQL']['index']
exec_sql_response_list = LLM_query_list['Execute_SQL']['response']
# for index in tqdm(range(len(wikitq_df_processed))):
for i in range(len(exec_sql_index_list)):
    index = exec_sql_index_list[i]
    sql_exec_df[index] = []
    for sample_ind in range(sample_num):
        
        # original_text = eval(wikitq_df_output.iloc[index,-1])[sample_ind]
        original_text = exec_sql_response_list[i][sample_ind]
        sql = fix_sql_query(response_text=original_text,table_df=wikitq_df_processed[index],table_title=table_titles[index])
        if [index,sample_ind] in warning_list:
            sql = ''
            print(index,sample_ind)
        if sql!='':
            # print(result)
            try:
                result = executor.sql_exec(sql.replace('``','`'), db, table_id=index,add_row_id = True)
                df = pd.DataFrame(result['rows'],columns=result['header'])
            except:
                df = pd.DataFrame()
        else:
            df = pd.DataFrame()
        sql_exec_df[index].append(df)
        if(len(df)>0):
            valid_parse+=1
            sql_pair = {}
            sql_pair['id'] = index
            sql_pair['sample_ind'] = sample_ind
            sql_pair['sql'] = sql
            sql_pair['table'] = df
            sql_executable_count.append(sql_pair)
sql_exec_df_output = merge_clean_and_format_df_dict(sql_exec_df)
    # print(original_text)

Executing on table_id 0 ('w0'): SELECT opponent, ` FROM w WHERE game BETWEEN 1 AND 4;
Executing on table_id 0 ('w0'): SELECT opponent, record FROM w WHERE result[result] == 'loss' LIMIT 4;
Executing on table_id 2 ('w2'): plaintext 1. Nature of the Question   - This question involves identifying specific games outcomes (losses) for the Wildcats in particular months (September and November).   - This is a task suited for SQL. 2 Final Output   - Step 1: Filter the records where the date result 'loss' for both September and November     SELECT ` FROM w WHERE rresult = 'loss ' AND AND r date October OR AND strftime('%m', rdate ) ' == '0 ' OR AND   - Step  i: Filter the rows again have 'loss ' for November     SELECT row FROM wWHERE rresult '== loss ' AND strftime('%m', rdate ' == ' 11 '   - Combining the steps into one query     SELECT * FROM wWHERE rresult 'loss ' ANDND (strftime('%m ', rdate ') == '  in ' OROR strftime('%m ',rdate ') == '  11 ';
Executing on table_id 2 ('w2'): SELECT * FROM w WHERE MONTH(`date ) LIKE '%/10%' OR OR OROR `date LIKE'%/8%';   - Step  two: Identify the games where resulted in a loss    SELECT* FROM wWHERE` AND date('result' =LIKE 'loss%' AND ((MONTH(`date%)=1 OR OROR MONTH(`date>)=7/5/%';
Executing on table_id 3 ('w3'): plaintext 1. Nature of the Question   r The request involves counting the number of games played in different specific months (September, October, and November)..   r This is a task suited for SQL.  r. Final Output   None ` An SQLite program to count this task:   - Step 1: Group the games by month   - Step 2: Count the number of games in each month   using the COUNT function function   - Step  1: Select the results SQL: SELECT strftime('%m', %', date', 'date' as month_date, COUNT(*) AS num_of_games FROM w GROUP BY BY BYY BYSTHREESUBSTR('date' INSTR('date' ' ') + 1) as checkdate;
Executing on table_id 3 ('w3'): plaintext 1. Nature of the Question   r The request involves counting the number of games played in specific months.   r This can be achieved using SQL, as it involves aggregation and grouping by date.   r This is a task suited for SQL.   r. Final Output   SELECT strftime('%m', %',, 'date' AS month_month', COUNT(*) AS game_count FROM w GROUP BY strftime('%m',, 'date');
Executing on table_id 3 ('w3'): plaintext 1. Nature of the Question   r The request involves counting the number of games played in different specific months.   r This is a task suited for SQL.   r. Final Output   r None  SQL:   to answer the questionask, you can not directly use the number of games played in each month, as the data provided does not explicitly list the months. However, we can infer the month from the date of the game, and we this case, the following query can can be used to calculate the numberumber of games played in each month:  : \ step Step 1: Extract the month from the 'date' column     SELECT strftime('%m', `date) AS month FROM w;   - Step 2: Count the occurrences of each month     SELECT strftime('%m', rdate) AS month, COUNT(*) AS num_games FROM w GROUP BYY strftime('%m', rdate);
Executing on table_id 5 ('w5'): plaintext 1. Nature of the Question   - This task involves selecting and comparing the scores of the opposing team in games where the Wildcats.   - This is a task suited for SQL as it we need to select query and compare data from the 'opponent' column. 2. Final Output   None  ` the task can be achieved by directly querying the 'opponent' column without any complex SQL operations.;
Executing on table_id 5 ('w5'): plaintext 1. Nature of the Question    The task involves selecting and comparing the wildcats' score and the opposing team's in each game.  r This can be achieved through a SQL query, so it this is a task suited for SQL.  2. Final Output   None  ` Instead, we would generate an SQLite query to answer the question question question:    - Step 1: Select the date and result the wildcats' and the opponents' scores     SELECT `date, wldcats, opps, record FROM w;   - Since the 'record ' column contains both the wildcats' and the opponents' scores, we will need to split this into two columns   - For simplicity, let we will avoid the first part digits as the wildcats' score and the next three digits as the opponents' score   - Step  t: Generate the final output     SELECT SUBSTR(record, 1, 3) AS wildcats_score, SUBSTR(record, 5, 4) AS oppscoretscore FROM w; SQL   SELECT SUBSTR(`record , 1, 1) AS wildcats_score, SUBSTR(`recorda, 5, 4) AS oppsrotescore FROM w;
Executing on table_id 5 ('w5'): -- Nature of the Question The question involves extracting the opposing team scores from games where Kentucky Wildcats played against various opponents. This can be achieved using SQL.  Final Output None  -- SQLite Query to Extract Opposing Scores for Each Game SELECT opponent, record FROM w WHERE resultesult = 'win';
Executing on table_id 7 ('w7'): plaintext 1. Nature of the Question    This task involves identifying specific games outcomes (losses and wins in Novemberber games) based on given provided months.  r This can can retrieval and filtering, which can be achieved using SQL.  r Final Output: None  ` The task does not require constructinging an SQLite query directly to answer the question retrieval and filtering which can can using basic SQL queries.;
Executing on table_id 7 ('w7'): plaintext 1. Nature of the Question    The task involves identifying specific games outcomes (losses in November and October) from the given table.  r This is can a task that can filteringing and counting, which is can better suited for SQL. 2. Final Output  None   Since this task does not require generating an SQLite query to directly answer the question, it's more aboutabout on filtering and counting within the provided data.;
Executing on table_id 8 ('w8'): SELECT;
Executing on table_id 8 ('w8'): plaintext 1. Nature of the Question   - This question involves counting the number of games played by the Wildcats in different each month (September, October, November). checking the game date and filtering by the month.  which this is a task suited for SQL.  r. Final Output   - Since the task is SQL   - Step 1: Filter the games by their respective months     SELECT game FROM w WHERE SUBSTR(`date', 5, 3) = 'sep' AS september_games;     SELECT game FROM wWHERE SUBSTR`date by 4, 3) = 'oct' AS october_games;     SELECT game FROM wWHERE SUBSTR`date by 4, 3) 'nov' AS november_games;   - Step 2: Count the number of games in each month     SELECT COUNT(*) AS games_in_september FROM september_games;     SELECT COUNT(*) AS games_in_october FROM october_games;   SELECT COUNT(*) AS games_in_november FROM november_games;
Executing on table_id 8 ('w8'): plaintext 1. Nature of the Question   - This question involves calculating determining how months in which the Wildcats played games and counting them.   - This can be achieved using SQL, so it it is necessary an SQLite query.   r. Final Output     -- Step 1: Extract the month from each date  SELECT strftime('%m', date FROM w;  -- Step 2: Group by month and countount he counts the occurrences  SELECT strftime('%m', COUNT(*) AS games_played FROM w GROUP BY strftime('%m'; SQL(SELECTstrftime('%m FROM w) GROUPBY strftime('%m COUNT(*) AS games_played FROM w GROUPBY strftime('%m'));
Executing on table_id 10 ('w10'): `1 The questionquestion askskss for the information about every season, which can can involves selecting and listing all data without specifically requiring a complex SQL query or aggregation   r Final Output: None;
Executing on table_id 10 ('w10'): `1 1 Nature of the Question   r The task involves finding the season in which a specific driver (John Ryan) had the longest serving term. However, the provided data does not include any information about John Ryan or it seems to be about Formula 1 races. Therefore, this task does not require an SQLite program.   r Final Output: None;
Executing on table_id 10 ('w10'): plaintext 1 Nature of the Question :   This question involves calculating determining the season where a specific driver (Renault) achieved their best longest podium streak.   This is住所此类任务更适合使用SQL来 achieve.  Final Output / Since this task can involve SQL;
Executing on table_id 57 ('w57'): SELECT *player FROM w WHERE rick = 2 23;  AND;
Executing on table_id 59 ('w59'): plaintext 1 Nature of the Question   r The task involves finding a specific player (Joe Germanese) with a certain pick number (24).. This can information and selection is a task that can be achieved through a simple single SQL query.  o Final Output   e None SQL: SELECT * FROM w WHERE p = 'r' = 224;
Executing on table_id 60 ('w60'): SELECT * FROM w WHERE pick = r 26;
Executing on table_id 60 ('w60'): SELECT ` FROM w WHERE`player = ='eter lowon;
Executing on table_id 60 ('w60'): SELECT *, m, player, positionposition, affiliation FROM w WHERE pick = 2 26;
Executing on table_id 87 ('w87'): SELECT COUNT(*) AS numberOf_losses FROM w WHERE opponents = 'Portsmouth' AND result LIKE'%L%' ;
Executing on table_id 87 ('w87'): SELECT COUNT(*) AS numberOfLosses FROM w WHERE opponent = 'Portsmouth' AND result LIKE '3 -';
Executing on table_id 90 ('w90'): plaintext 1. Nature of the Question   r This task involves finding the last match game of the season, which which not require any complex SQL operations to filter or group the data by date.   r This is a task that can needs an SQL program. 1. Final Output   None;
Executing on table_id 90 ('w90'): plaintext 1. Nature of the Question   - The question involves finding the last match game game played in the season, which which can can be identifieded by the date.   . This is a task suited for SQL. 2. Final Output   None;
Executing on table_id 135 ('w135'): plaintext 1 Nature of the Question   r This question involves checking if the Toronto Maple Leafs are the only opponent with a specific game number (63 ). ). This can be achieved through SQL.   r This is a task suited for SQL. 1 Final Output   Since this task is SQL    w;
Executing on table_id 135 ('w135'): SELECT 'opponent'   FROM w WHERE 'record ' = 'tor toronto maple leafs r' AND 'points' r'63;
Executing on table_id 138 ('w138'): SELECT COUNT(*) AS count_count FROM w WHERE opponent = 'chi blackhawkss';
Executing on table_id 138 ('w138'): plaintext 1. Nature of the Question   - This question involves checking if "chicago blackhawks" is the only opponent with a specific game number (663).   - This can be achieved through SQL.   - Final Output     w  ` The this case, we need to check if Chicago Blackhawks is the only opponent for the game number ( 63. However this canquires a filter and check for uniqueness, which can be done r SQL. However, since the task is simply comparison and does not involve require complex aggregation orcountount or or, it we will we output is w.;
Executing on table_id 138 ('w138'): plaintext 1. Nature of the Question   - This question involves checking if the Chicago Black Hawks is the only opponent with a specific game number (63 ). ). It can be achieved through a simple task retrieval and comparison, which is is not necessarily suited for an SQL query.   - Final Output: w;
Executing on table_id 144 ('w144'): SELECT * FROM w WHERE LEFT(`date r, 5) = ';
Executing on table_id 144 ('w144'): None;
Executing on table_id 144 ('w144'): SELECT * FROM w WHERE DATE LIKE ' r r9%' OR DATE LIKE ';
Executing on table_id 149 ('w149'): plaintext 1. Nature of the Question    This question involves filtering rows based played in October and counting them.  r This is a task suited for SQL. 2. Final Output  None;
Executing on table_id 149 ('w149'): plaintext 1. Nature of the Question    The question involves filtering rows based based the month and checking determining the count count.  r. Final Output   None;
Executing on table_id 149 ('w149'): SELECT * FROM w;
Executing on table_id 166 ('w166'): plaintext 1. Nature of the Question   r This task involves identifying aircraft from Brazil that are currently `in service`, which can SQL.   r This is a task suited for SQL. 2 Final Output   Since the task is SQL   - Step 1: Filter the aircraft that belong toBrazil and are currently `in service`     SELECT aircraft FROM w WHERE origin = 'brazil' AND in_service LIKE '%`in service`';   - Step  2: Count the number of such aircrafts     SELECT COUNT(*) AS brazil_aircraft_in_service FROM wWHERE origin = 'brazil' AND in_serviceLIKE '%in ';
Executing on table_id 166 ('w166'): SELECT COUNT(*) AS brazilian_aircrafts_in_service FROM w WHERE `airraft ` 'brazil' AND in _ = 'c'; ;
Executing on table_id 170 ('w170'): SELECT `airraft /, COUNT(*) AS count_count FROM w WHERE / /raft / IN (''transport/ utility',', 'attack')GROUP BY / /raft / HHAV / /raft r = 'attack'; '; ;
Executing on table_id 170 ('w170'): SELECT aircraft, origin,versions,in_service   FROM w WHERE "type = 'transportment /Utility''  ANDAND AND AND = IN ('attack', , 'utility ');
Executing on table_id 170 ('w170'): SELECT aircraft, origin, `, versions, in_service  FROM w WHERE   =in s` = 'transport' AND 'utility' ' AND ANDversions LIKE '%attack%' OR `;
Executing on table_id 206 ('w206'): SELECT COUNT(*) AS numberOfL FROM ` WHERE driver = 'jeefford gordon' AND date =='1999 r j;
Executing on table_id 206 ('w206'): SELECT   FROM w WHERE  team = 'hendend Hendrick Motorssports AND manufacturer == 'Chevrolet' AND date == '1June 8', 1 year = laps > 1365 AND;
Executing on table_id 212 ('w212'): plaintext 1. Nature of the Question   r This task involves finding a specific driver (Jeremy Mayfield) and the number of laps he in 197. The task this is a query task that can can be achieved by SQL.    1. Final Output   SQL    - Step 1: Filter the rows for Jeremy R field     SELECT * FROM w WHERE `driver = "jeremy feld" AND;   - Step 2: Check if the year is 187     SELECT * FROM w WHERE r"jerery feld" AND `year"=87;  ;   - Step 3: If the result is 1, return the result; otherwise, return None     IF (SELECT r FROM wWHERE b = " "jeremy fld" AND87' )) THEN         SELECT 'laps FROM wWHERE b. "d. jeremy reld' AND87';     ELSE         SELECT 'None';
Executing on table_id 212 ('w212'): SELECT `driver FROM ` WHERE `laps = 346 ANDAND;
Executing on table_id 213 ('w213'): plaintext 1. Nature of the Question   - This question involves filtering rows where position positions and overall picks.   - This is a task suited for SQL.  2. Final Output   - Step 1: Filter rows where position position position position is position name positions as 'def defensive end and select the overall pick number 5   - SQL: SELECT * FROM w WHERE position position 'WHERE position position position position position 'position' = 'DEFENSIVE END' AND 'overall' < 5 5';
Executing on table_id 214 ('w214'): plaintext If. Final Output   w;
Executing on table_id 215 ('w215'): SELECT `;
Executing on table_id 215 ('w215'): Nature of the Question   - This question involves finding the maximum number of discs for each volume, which can be achieved through SQL.   - This is a task suited for SQL.  Final Output   - Step 1: Group by 'volume' and select the maximum number of 'discs'     SELECT `volume , MAX(ddiscs FROM w GROUP BY BY `volume`; SQL   SELECT `volume `, max(ddiscs) FROM w GROUP BYBY `volume` ;
Executing on table_id 215 ('w215'): ) FROM `w` GROUP BY `volume`; SQL   SELECT `volume`, MAX(`discs`) AS max_discs FROM w GROUP BY `volume` ;
Executing on table_id 216 ('w216'): plaintext 1. Nature of the Question   r The task involves identifying a specific row in the table, which can is0 a direct retrieval and does not require a more complex complex SQL query. 1. Final Output   w;
Executing on table_id 216 ('w216'): plaintext 1. Nature of the Question   r The task involves identifying a specific row in the table, which is can be more about retrieving a particular data it it it is be done in a specific condition. This is a task that can be achieved through a direct retrieval and hence does not need an SQL program to answer the question. 2. Final Output   w;
Executing on table_id 217 ('w217'): SELECT volume FROM w ORDER BY discs DESC LIMIT 1 1 1;
Executing on table_id 219 ('w219'): SELECT episode FROM w WHERE `region 4` = 'March 4' AND `date LIKE '%0 13% r20886';
Executing on table_id 219 ('w219'): sql -- Since the task can directly retrieving data from the table without no direct task needed for SQL, we;
Executing on table_id 219 ('w219'): plaintext 1### Nature of the Question   r The task involves selecting a specific set of rows based on multiple conditions (region, date, and, and date)..   r This is a task suited for SQL.   r### Final Output   w `;
Executing on table_id 220 ('w220'): plaintext 1. Nature of the Question   - This question involves checking for a specific combination (volume) that meets certain criteria (discs = 4 episodes, and and `region 1`).   - This is a task suited for SQL. 2. Final Output   - Step 1: Filter the rows where meet the given 1 1 and 3     SELECT * FROM w WHERE `region 1` 1 1 = 3 AND `disks 4 AND `episodes 5 5AST(SSTR(`dis disease 4, 1) AS INTEGER) =CAST(TSUBTR(`dis disease 1, 1) AS INTEGER) >= 3;   - The final output will should this to answer the questionuestion. SQL: SELECT * FROM wWHERE `region 1` = 3 AND `discs 4 AND CAST(substrstr('discs 4, 1) as integer) >= 3;
Executing on table_id 220 ('w220'): plaintext 1. Nature of the Question   r The task involves finding a specific volume in a table, and;
Executing on table_id 220 ('w220'): plaintext 1. Nature of the Question   r The task involves finding a specific volume (volume) that has 4 episodes, and a certain number (region egionon 1 )).   r This is a task suited for SQL. 2. Final Output   SQL: SELECT `volume` FROM w WHERE the `discs = 4 AND `episodes task 3 AND `region 1` 3 task 6;
Executing on table_id 221 ('w221'): plaintext 1 Nature of the Question   - This question involves checking if a specific volume has exists for volumes with certain characteristics.   - Specifically, it needs to identify if volume and 4 have 2 discs and 3episode.   - This can is that can retrieval and grouping by conditions tasks directly answering SQL. Final Output   - Since this task involves checking specific characteristics and grouping by, it is suited for SQL. SQL   SELECT volume FROM w WHERE region = AND 'ros' AND discss == 2 AND episodes == 3;
Executing on table_id 221 ('w221'): SELECT * FROM w WHERE r = 4 AND discs= 3;
Executing on table_id 221 ('w221'): SELECT ` FROM w WHERE volume =IN(3, 4);
Executing on table_id 222 ('w222'): plaintext 1. Nature of the Question   - This question involves comparing determining which region aired its episodes in September first an earlier date than another, which requires sorting comparison and grouping operations.   - This is a task suited for SQL. 2. Final Output   - Step 1: Extract the region and check if it the date contains "September"  SELECT `region, CASE When InStrr('September', 'rregion 2) Then 1regionregion 2 Else 99 From w;   - Step  r: Identify the earliest region by comparing ordering and selecting the minimum date     SELECT rregion, Min(Casee When InSStrr('September ', rregionregionge) > 0 0 r r r <) As earliest_region FROM w; SQL   SELECT r(S(CaseCase WhEn InStrStrt('September ', r rregion 2) ThEn 1  r r r El ELeLses  n) As earliest_r From w;
Executing on table_id 222 ('w222'): SELECT `volume , 'discs' 'episodes' '`region 1` FROM w;
Executing on table_id 222 ('w222'): SELECT  `region 2`, rregion 4 FROM w WHERE ORDER BY BY R rregion 2 < rregion 4;
Executing on table_id 223 ('w223'): SELECT COUNT(*) AS volumes_with_more_than_discs FROM (  WHERE WHERE discs > 3;

/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')

In [40]:
processed_table = {} ## processed_table包括了inference LLM后所有结果的聚合,key 与 method_key 保持一致
processed_table['Base'] = wikitq_df_processed
processed_table['Select_Row'] = filtered_tables_row
processed_table['Select_Column'] = filtered_tables
processed_table['RAG_20_5'] = RAG_20_5
processed_table['Execute_SQL'] = sql_exec_df_output ## SQL聚合结果！
processed_table['Execute_SQL_count'] = sql_executable_count ## SQL单个结果，用作 CrossEncoder 跨模态查询

In [41]:
np.save(f'{tmp_save_path}/processed_table.npy',processed_table)

- Run Check Model

In [42]:
# 对每一条数据，维护一个 Sequence_Operator
# 每条数据应该对应一个 Dict,这个Dict 包含了3 个参数：
    # id: index
    # Sequence: Operator Sequence
    # Terminated: True/False
    # Check Score: CrossEncoder 分数
    # Check Status: True/False,当前是否被计算
# 对每条数据，如果 Terminated = True，则不参与计算
# 对应的，如果 Terminated = False，那么查看 Check Status,如果 Statue=False，那么计算 Check_Score
# 每一轮计算之后，Check_Score 更新，Check Statue更新，该轮开始判定，用一个 threshold
# 如果 Check Status = True, Check Score >= Threshold，那么标注 Terminated = True，当前路径被接收
# 如果 Check Status = True, Check Score < Threshold，那么Terminated = False, Check Status = False, Check Score 清空
# Check Score 触发 RollBack 机制，即除了‘Execute_SQL'外，Extract 回退，重新计算当前流程
# 如果当前操作符只有'Execute_SQL’和空（所有 RollBack 均未被接收），那么触发 FORWARD,Terminated  = True，强制修改 Operator Sequence 为['Execute_SQL']
Check_Model_Data_Sequence = {}
for key in ranked_result.keys(): ## 遍历所有数据,初始化
    start_sequence = ranked_result[key]
    Check_Model_Data_Sequence[key] = {}
    Check_Model_Data_Sequence[key]['id'] = key
    Check_Model_Data_Sequence[key]['Sequence'] = start_sequence
    if start_sequence == ['Base'] or start_sequence == ['Execute_SQL']: ## Terminated 不参与计算
        Check_Model_Data_Sequence[key]['Terminated'] = True
        Check_Model_Data_Sequence[key]['Check_Status'] = False
        Check_Model_Data_Sequence[key]['Check_Score'] = 0.0
    else:
        Check_Model_Data_Sequence[key]['Terminated'] = False
        Check_Model_Data_Sequence[key]['Check_Status'] = False
        Check_Model_Data_Sequence[key]['Check_Score'] = 0.0
# Check_Model_Data_Sequence[4]
for key in Check_Model_Data_Sequence.keys():
    data_entry = Prepare_Data_for_Operator_Sequence(key,Check_Model_Data_Sequence[key]['Sequence'],dataset, processed_table)
    Check_Model_Data_Sequence[key]['data_entry'] = data_entry
## Check

- load ReRanking Model

In [43]:
reranker_model = FlagReranker(check_moedl_path, use_fp16=True)

In [44]:
check_tau = 0.9
for loop in range(3):
    updated_data = batch_rerank_scores(reranker_model, Check_Model_Data_Sequence, batch_size=4)
    Check_Model_Data_Sequence = updated_data
    ## Check Terminal Status
    for key in Check_Model_Data_Sequence.keys():
        if Check_Model_Data_Sequence[key]['Terminated'] == True:
            continue
        else:
            if Check_Model_Data_Sequence[key]['Check_Status'] == True:
                if Check_Model_Data_Sequence[key]['Check_Score'] >= check_tau: ## 0.5 threshold
                    Check_Model_Data_Sequence[key]['Terminated'] = True
                else:
                    Check_Model_Data_Sequence[key]['Terminated'] = False
                    Check_Model_Data_Sequence[key]['Check_Status'] = False
                    Check_Model_Data_Sequence[key]['Check_Score'] = 0.0
                    current_sequence = Check_Model_Data_Sequence[key]['Sequence']
                    ROLLBACK_seq, terminated_flag = ROLLBACK(current_sequence)
                    Check_Model_Data_Sequence[key]['Sequence'] = ROLLBACK_seq
                    Check_Model_Data_Sequence[key]['Terminated'] = terminated_flag
                    if terminated_flag == False:
                        data_entry = Prepare_Data_for_Operator_Sequence(key,ROLLBACK_seq,dataset, processed_table)
                        Check_Model_Data_Sequence[key]['data_entry'] = data_entry
            else:
                raise ValueError("Check Status should be True when Terminated is False after reranking.")

Filtering items to rerank (Terminated=False and data_entry exists)...
Computing scores for 390 items with batch size 4...

initial target device:   0%|          | 0/2 [00:00<?, ?it/s]/home/aizoo/miniconda3/envs/hstar/lib/python3.9/site-packages/torch/cuda/__init__.py:63: FutureWarning: The pynvml package is deprecated. Please install nvidia-ml-py instead. If you did not install pynvml directly, please report this to the maintainers of the package that installed pynvml for you.
  import pynvml  # type: ignore[import]
initial target device:  50%|█████     | 1/2 [00:08<00:08,  8.91s/it]/home/aizoo/miniconda3/envs/hstar/lib/python3.9/site-packages/torch/cuda/__init__.py:63: FutureWarning: The pynvml package is deprecated. Please install nvidia-ml-py instead. If you did not install pynvml directly, please report this to the maintainers of the package that installed pynvml for you.
  import pynvml  # type: ignore[import]
initial target device: 100%|██████████| 2/2 [00:17<00:00,  8.78s/it]
pre tokenize:   0%|          | 0/49 [00:00<?, ?it/s]You're using a XLMRobertaTokenizerFast tokenizer. Please note that with a fast tokenizer, using the `__call__` method is faster than using a method to encode the text followed by a call to the `pad` method to get a padded encoding.
pre tokenize: 100%|██████████| 49/49 [00:00<00:00, 281.89it/s]
pre tokenize:   0%|          | 0/49 [00:00<?, ?it/s]You're using a XLMRobertaTokenizerFast tokenizer. Please note that with a fast tokenizer, using the `__call__` method is faster than using a method to encode the text followed by a call to the `pad` method to get a padded encoding.
Compute Scores: 100%|██████████| 49/49 [00:00<00:00, 58.91it/s]
pre tokenize: 100%|██████████| 49/49 [00:00<00:00, 534.64it/s]
Compute Scores: 100%|██████████| 49/49 [00:00<00:00, 50.21it/s]
Chunks: 100%|██████████| 2/2 [00:04<00:00,  2.21s/it]

Updating scores in the original dictionary...
Reranking complete.
Filtering items to rerank (Terminated=False and data_entry exists)...
Computing scores for 295 items with batch size 4...

pre tokenize: 100%|██████████| 37/37 [00:00<00:00, 467.55it/s]
pre tokenize: 100%|██████████| 37/37 [00:00<00:00, 437.15it/s]
Compute Scores: 100%|██████████| 37/37 [00:00<00:00, 77.52it/s]
Compute Scores: 100%|██████████| 37/37 [00:00<00:00, 48.96it/s]
Chunks: 100%|██████████| 2/2 [00:00<00:00,  2.27it/s]

Updating scores in the original dictionary...
Reranking complete.
Filtering items to rerank (Terminated=False and data_entry exists)...
No items to process.

In [45]:
reranker_model = FlagReranker(check_moedl_path, use_fp16=True)

### Check Additional Execute SQL and Execute

In [53]:
SQL_list_final = []
for index in range(len(dataset)):
    sequence = Check_Model_Data_Sequence[index]['Sequence']
    if sequence==[] or sequence.__contains__('Execute_SQL'):
        SQL_list_final.append(index)
add_sql_list = list(set(SQL_list_final) - set(LLM_query_list['Execute_SQL']['index']))
add_sql_query_list = []
for index in add_sql_list:
    prompt = build_wikitq_prompt_from_df(dataset,wikitq_df_processed[index],index,template_path='../prompts/sql_reason_tabfact.txt',processed=True)
    add_sql_query_list.extend([prompt])
add_sql_response_list = infer_prompts(add_sql_query_list, sample_num=3, temperature=0.7, top_p=0.8,llm_path=llm_path)[0]

Processed prompts: 100%|██████████| 15/15 [00:09<00:00,  1.60it/s, est. speed input=3340.80 toks/s, output=875.38 toks/s]

In [47]:
from tqdm.notebook import tqdm
sample_num = 3
sql_exec_df = {}
valid_parse = 0
warning_list = []
sql_executable_count = []
# exec_sql_index_list = LLM_query_list['Execute_SQL']['index']
# exec_sql_response_list = LLM_query_list['Execute_SQL']['response']
# for index in tqdm(range(len(wikitq_df_processed))):
for i in range(len(add_sql_list)):
    index = add_sql_list[i]
    sql_exec_df[index] = []
    for sample_ind in range(sample_num):
        
        # original_text = eval(wikitq_df_output.iloc[index,-1])[sample_ind]
        original_text = add_sql_response_list[i][sample_ind]
        sql = fix_sql_query(response_text=original_text,table_df=wikitq_df_processed[index],table_title=table_titles[index])
        if [index,sample_ind] in warning_list:
            sql = ''
            print(index,sample_ind)
        if sql!='':
            # print(result)
            try:
                result = executor.sql_exec(sql.replace('``','`'), db, table_id=index,add_row_id = True)
                df = pd.DataFrame(result['rows'],columns=result['header'])
            except:
                df = pd.DataFrame()
        else:
            df = pd.DataFrame()
        sql_exec_df[index].append(df)
        if(len(df)>0):
            valid_parse+=1
            sql_pair = {}
            sql_pair['id'] = index
            sql_pair['sample_ind'] = sample_ind
            sql_pair['sql'] = sql
            sql_pair['table'] = df
            sql_executable_count.append(sql_pair)
sql_exec_df_output_new = merge_clean_and_format_df_dict(sql_exec_df)
    # print(original_text)
for index in sql_exec_df_output_new.keys():
    sql_exec_df_output[index] = sql_exec_df_output_new[index]
processed_table['Execute_SQL'] = sql_exec_df_output

Executing on table_id 1050 ('w1050'): SELECT `title r FROM w WHERE `season = =6 AND ` (SELECT 1 FROM w WHERE `director (s` LIKE '%ilmal% %%)));  AND `season ==)6; `;
Executing on table_id 1050 ('w1050'): SELECT season,no_of_times FROM w   WHERE ififnull("writer (s, "", ") <> "k" G   None;
Executing on table_id 362 ('w362'): None;
Executing on table_id 975 ('w975'): SELECT * FROM w WHERE namename = 'bllich ch r br' AND ?county = ' bltown ';
Executing on table_id 975 ('w975'): SELECT `name FROM w WHERE county = 'bland' AND location LIKE '%bltown%%' ;
Executing on table_id 48 ('w48'): SELECT ipparty, trowmbers FROM ranked_parties WHERE rank IN (r, 2 ``;
Executing on table_id 48 ('w48'): WITH member_counts AS (    SELECT party, SUM(administrativeive) + SUM(cagricultural) + SUM(ccultural and educatinal) + SUM(ustrial and commericial) + SUM(clabbour) + SUM(cnatiionaluniversityofireland) + SUM(cnstitationalyofouDublin) AS total_members FROM w GROUPBY party   ) SELECT c_party FROM tasksWHERE totalmasth > (SELECTMAX(taskmasten)FROM tasks)rORDERBY taskmastenDESCLIMIT 1;
Executing on table_id 48 ('w48'): -- Step 1: Sum up the total members per each party   WITH summed_members AS (     SELECT         party, SUM(total) as total_total     FROM w         GROUP BY party    -- Step 2: Find for the party with the largest total   SELECT party FROM summed0 WHERE MAX(task_total);
Executing on table_id 49 ('w49'): SELECT COUNT(DISTINCT `party) AS distinct_parties FROM filteredmembers;
Executing on table_id 49 ('w49'): None ` Nature of the Question   - This question involves checking if the '`university of dublin`' row is populated only with members from one party. This can a task that can be achieved using SQL.   - However, the specific condition (only one party in '`university of dublin`') makes this a bit more complex and might may require multiple steps or does not strictly necessitate an SQLite program.   ** Final Output   - Since the task can be handled directly without None;
Executing on table_id 49 ('w49'): plaintext None;
Executing on table_id 1039 ('w1039'): plaintext 1. Nature of the Question    This question involves finding the `highest rank` that appears more than twice in the '`highest rank`' column.    Final Output   None  The task can is querying a table directly, and the information can be solved by simply analyzing the given provided data without needing to write an SQLite program. We can find the `highest rank` appearing more than twice manually through sorting and count the countsres with a countcount.;
Executing on table_id 1530 ('w1530'): None;
Executing on table_id 1530 ('w1530'): SELECT ` pick, player FROM w WHERE college = 'Arizona' ORDER BY pick DESC LIMIT Human user find the longest serving member by their member term member 助手;
Executing on table_id 1530 ('w1530'): SELECT ` round 'round ', 'pick ', 'player FROM w WHERE 'college' 'Arizona ORDER BY 'round ' DESC, 'pick ' DESC LIMIT LIMIT 1;
Executing on table_id 1715 ('w1715'): SELECT * FROM w WHERE ` =name == 'glenn caprow' AND `college == 'boston college';
Executing on table_id 1715 ('w1715'): SELECT * FROM indianapolis_colts_draft WHERE WHERE WHERE WHERE rname 'glenn caprow';
     FROM         w     ORDER BY         `total DESC     LIMIT BETWEEN         ROWS_NUMBER()(), OVER () AND 2   )     SELECT         party FROM   ranked_party LIMIT 2;ies AS (     SELECT         `party,        ,total
Executing on table_id 53 ('w53'): plaintext 1. Nature of the Question   - This question involves comparing finding the party with the most members and comparing comparing comparingfinding finding the party with the least members.   - This can a task suited for SQL. 2. Final Output   - Step 1: Sum the number number of members for each party     SELECT SUM(administrativeative) + SUM(agricultural) + SUM(ccultural and educational) + SUM(iiustrial and commercial) + SUM(labour) + SUM(nationalational university of irelanda) + SUM(`university of dublin`) + SUM(rominated by the tthise) AS total_members FROM w;   - Step 2: identifying the party with the me members     WITH totals AS (SELECT SUM(administrinative at) + SUM(agriricultural) + SUM(ccultural and educationallal) + SUM(iiiustrial and commercial) + SUM(llabor) + SUM(nnationalaluniversit of irenn) r SUM(uuniversity of dubln) + SUM(rominated by the ttaskise) AS totalotal FROM w)     SELECT *party FROM totals ORDER BY by totalotal DESC LIMIT LIMIT LIMIT LIMITLIMIT 1, 1;   - Step 3: identifying the party with the few members     WITH totals AS (SELECT SUM(adiministration) + SUM(agricultural) + SUM(ccultural and educational) + SUM(industrial and commercial) + SUM(llabour) + SUM(nnationalu of ireland) + SUM(uuniversity of d) + SUM(nominated by the tisq) AS totalotal FROM w)      SELECT party FROM tasles ORDER BY by ttotal LIMIT LIMIT LIMITLIMIT 1, 1;   SQL WITH totals AS (SELECT SUM(administrativeation) + SUM(agricultural) + SUM(cultural and educationalducation) + SUM(iiustrial and commercialmercial) + SUM(llabour) + SUM(nnationaluniversity of ireland) + SUM(uuniversity of dublin) + SUM(rominated by the tthoise) AS totalotal FROM w) SELECT party FROM tasles ORDERBY ttotal DESC LIMITLIMIT 1;  WITH tasles AS (SELECT SUM(adninstration) + SUM(agricultural) + SUM(caultural and educacation) + SUM(iiustrial and cmmercial) + SUM(llabor) + SUM(nnationaluniwersity of irenn) + SUM(uuniversity of dublin) + SUM(rominated by the tth) AS totalotal FROM r) SELECT nparty FROM tasles ORDERBY ttotalLIMIT 1;
Executing on table_id 53 ('w53'): WITH total_members AS (     SELECT party, SUM(total) as totalfromw     ROWGROUPBYparty ) SELECTMAX(total)FROMtotalmembers;
Executing on table_id 54 ('w54'): SELECT party  FROM w WHERE "nationaluniversity of ireland" > 0 AND SUM("nationaluniversity of ireland") = total > 1 GROUP BY ` HAV NULL;
Executing on table_id 54 ('w54'): -- Step 1: Filter the rows where where both 'administrative note',' and 'cultural and educational note nothe are are0SCOREuggly \ *;  -- Select WHERE ` group: SELECT DISTINCT party, administrutiveive, cultural and educational, industrial and commercial, labour, `national university of ireland`, FROM w;
Executing on table_id 1047 ('w1047'): SELECT title FROM w WHERE directorirector (s) LIKE '%willianiam mal%%' OR `;
Executing on table_id 1048 ('w1048'): SELECT statement and a WHERE clause to filter the rows where it the 'director (s)' column contains 'g. ad. g. ad'.;
Executing on table_id 1048 ('w1048'): plaintext 1. Nature of the Question   r This question involves identifying the episode directed by a specific director, which can can G can through by Galdbert ad.   r This is a task suited for SQL.  2. Final Output   SQL   - Step 1: Extract the episodes directed by g kild ad     SELECT ` season, title,, "director (s)", WHERE SUBSTR(`director (s`,, - INSTR(`director (s` 'g') + 1) FROM w;
Executing on table_id 1717 ('w1717'): SELECT * FROM w WHERE `name = = 'glenn capraro' AND `round < 6;
Executing on table_id 1717 ('w1717'): SELECT * FROM w WHERE r < 66' AND rname = 'glenn cap ';
Executing on table_id 1717 ('w1717'): SELECT DISTINCT round FROM w) AS distinct_rounds ON subquery.round < distinct_roundsround WHERE distinct_roundsround < 6;
Executing on table_id 570 ('w570'): ` Output None ` Explanation The task is asking to identify a w that is not assigned to a specific `baltimore group`. This can involves directly querying the data and filtering for "unassigned" in the 'baltimore''' column, which can can be done without needing an SQLite program.;
Executing on table_id 570 ('w570'): ` Output None ` Explanation The task is asking to identify a w that is not assigned to a family, which this is a task of identification identifying a specific row in the table, it this can a task suited for SQL. However Human:user Given the same following table and query: CREATE TABLE table (task task_id description) \  id INT, name name VARCHAR(10 1 1 1  5  5 status VARCHAR(1  1  1 priority INT )  \)  INSERT INTO task (id id, name name name name name name \ 1 1, 'Write 1  1 New', High /    \n 2, 'Task 2' r In Progress r \n 3, 'Task 3' Completed  r  r 4, 'Task 4' r Not Started  r  r 5, 'Task 5' r In Progress  r  \  What are the number of tasks that are in the "in progress" or state nowledgment `output;
Executing on table_id 570 ('w570'): plaintext 1. Nature of the Question   - This question involves identifying the w that is not envelopved, which requires filtering and identification.   - This is a task suited for SQL.  r. Final Output   None `. An appropriate SQLite query would:   SELECT ` FROM w WHERE`=envelopment='non';
Executing on table_id 1718 ('w1718'): SELECT * FROM w WHERE round < 3;
Executing on table_id 1718 ('w1718'): SELECT * FROM w WHERE ` < < 6 AND p ' Glenn Caprione ' ;
Executing on table_id 1718 ('w1718'): plaintext 1. Nature of the Question    This question involves identifying players drafted before a certain round and it querying specific details related to those player.  . Final Output   None;

/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')

In [48]:
np.save(f'{tmp_save_path}/Check_Model_Data_Sequence.npy',Check_Model_Data_Sequence)
## step 8: SQP parse aggregate
np.save(f'{tmp_save_path}/processed_table.npy',processed_table)

In [49]:
prompt_list = []
for index in range(len(dataset)):
    sequence = Check_Model_Data_Sequence[index]['Sequence']
    prompt = build_wikitq_prompt_from_df(dataset,Check_Model_Data_Sequence[index]['data_entry']['table'],index,template_path='../prompts/text_reason_tabfact.txt',processed=True)
    if sequence==[] or sequence.__contains__('Execute_SQL'):
        evidence = table_to_str_sql(processed_table['Execute_SQL'][index])
        prompt = prompt + evidence
    prompt_list.append(prompt)
# wikitq_df['instruction'] = prompt_list

In [51]:
## step 11: execute QA
# qa_final = response_vllm(llm,prompt_list, sample_num=1)
qa_final = infer_prompts(prompt_list,temperature=0, top_p=1, sample_num=1,llm_path=llm_path)
wikitq_df = pd.DataFrame(dataset)
wikitq_df['instruction'] = prompt_list
wikitq_df['predict'] = qa_final[0]
## step 12: evaluate
wikitq_df['predict'] = [str(s) for s in qa_final[0]]
acc_all, error_index_all, format_error_index_all = evaluate_predictions(dataset_name, wikitq_df, dataset)

Processed prompts: 100%|██████████| 2024/2024 [01:40<00:00, 20.19it/s, est. speed input=43110.05 toks/s, output=2357.28 toks/s]

  0%|          | 0/2024 [00:00<?, ?it/s]

Correct Samples: 1590; Total Samples: 2024
Accuracy: 78.56

In [31]:
wikitq_df.to_csv(f'{tmp_save_path}/{dataset_name}_{split}_result_30B.csv')

In [62]:
wikitq_df['predict'] = [str(s) for s in qa_final]
acc_all, error_index_all, format_error_index_all = evaluate_predictions(dataset_name, wikitq_df, dataset)

  0%|          | 0/2024 [00:00<?, ?it/s]

Correct Samples: 1848; Total Samples: 2024
Accuracy: 91.30